주어진 데이터 중 basic1.csv에서 'f1'컬럼 결측 데이터를 제거하고, 'city'와 'f2'을 기준으로 묶어 합계를 구하고, 'city가 경기이면서 f2가 0'인 조건에 만족하는 f1 값을 구하시오

In [1]:
import pandas as pd
import numpy as np

In [12]:
df = pd.read_csv('../../Datasat/bigdata_certification_kr/basic1.csv')
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [13]:
df.isnull().sum()
# df.shape

id       0
age      0
city     0
f1      31
f2       0
f3      95
f4       0
f5       0
dtype: int64

In [14]:
df.shape

(100, 8)

In [15]:
df = df[~df['f1'].isnull()]
df.shape

# df = df.dropna(subset=['f1']) 도 가능

(69, 8)

In [16]:
df2 = df.groupby(['city','f2']).sum()
df2

                                                        id    age     f1   f3  \
city f2
경기   0   id69id72id74id75id76id77id80id84id85id88id91id...  720.4  833.0  vip
     1            id63id67id70id78id81id83id89id92id95id96  696.0  670.0  vip
     2                                id61id64id68id71id98  239.0  311.0    0
대구   0                        id40id41id43id45id49id53id57  387.0  527.0    0
     1                                        id47id50id52  217.6  235.0    0
     2                                        id42id55id58  140.0  211.0    0
부산   0                            id24id27id31id32id33id39  331.0  389.0  vip
     1                                id22id23id26id28id36  188.7  315.0    0
     2                                                id29  -13.5   47.0    0
서울   0                                    id06id11id13id16  145.0  278.0  vip
     1                    id02id03id07id08id10id14id15id20  315.3  534.0    0
     2                                        id05id09id18   68.3  207.0    0

                                                        f4          f5
city f2
경기   0   ESTJESTJESTPESTPENTJINFPISFPINTPINFJESTJINTPIS...  943.944823
     1            ISFJISFJISTPINTJISFJENTPENTJINFPINTJENTJ  657.241212
     2                                INTPESFPISFPISFPINFP  362.300060
대구   0                        ENFPENFJISTPENFJINTPESTPISFJ  183.199568
     1                                        ESTJENFPISFJ  241.333824
     2                                        ESTPENTPESTP   79.667919
부산   0                            INFJESTPESFJISFJENFJINFJ  284.371097
     1                                ENFPISTPENFPENTPINTP  299.270973
     2                                                ENTP   67.886373
서울   0                                    INTPENFPESFJESFP  218.528577
     1                    ENFJISTJISFJINFJISFPENTJENTPINTJ  438.485010
     2                                        ISFJESFJISFJ  126.661135

방법 1

In [32]:
#df2는 groupby로 묶었으므로 데이터프레임이 아닌 시리즈로 구성됨. 따라서 데이터프레임으로 변환하는 과정이 필요함.
df3 = pd.DataFrame(df2)
df3 = df3.reset_index()
df3.head()

,city,f2,id,age,f1,f3,f4,f5
0,경기,0,id69id72id74id75id76id77id80id84id85id88id91id...,720.4,833.0,vip,ESTJESTJESTPESTPENTJINFPISFPINTPINFJESTJINTPIS...,943.944823
1,경기,1,id63id67id70id78id81id83id89id92id95id96,696.0,670.0,vip,ISFJISFJISTPINTJISFJENTPENTJINFPINTJENTJ,657.241212
2,경기,2,id61id64id68id71id98,239.0,311.0,0,INTPESFPISFPISFPINFP,362.300060
3,대구,0,id40id41id43id45id49id53id57,387.0,527.0,0,ENFPENFJISTPENFJINTPESTPISFJ,183.199568
4,대구,1,id47id50id52,217.6,235.0,0,ESTJENFPISFJ,241.333824

In [44]:
answer = df3[df3['city']=='경기']
answer = answer[answer['f2']==0]['f1'].sum()
answer

833.0

방법 2

In [33]:
print(df2.iloc[0]['f1'])

833.0